/***************************************************************************
ユーティリティ・ソース                               作成者:シマフジ電機(株)
 ***************************************************************************/
#include "utility.h"

/***************************************************************************
 * [名称]    :conv_adxl2ssd
 * [機能]    :adxl345の1軸分のデータをOLEDの表示1列分のデータへ返還
 * [引数]    :uint8_t *src    軸データ(2byte)
 *            uint8_t *dest   表示データ(8byte)
 *            uint8_t mode    0=プロットのみ、1=プロット間にラインを引く
 * [返値]    :なし
 * [備考]    :
 ***************************************************************************/
void conv_adxl2ssd( uint8_t *src, uint8_t *dest, uint8_t mode )
{
    int16_t axis;
    uint32_t i, j, a, flg = 0;
    uint32_t da[2] = {0,0};
    uint32_t tmp[2];
    static int8_t   mode_on=0;
    static uint32_t da2[2] = {0,0};

    ////////////////////////////////////////////////////////
    /// データ変換
    ////////////////////////////////////////////////////////
    //1軸の値を取得
    axis = src[0] | (src[1]<< 8);

    //plus
    if( axis >= 0 ){
        da[0] = 0x80000000>>(axis>>3);
        //値が256以上
        if( da[0] == 0 ){
            da[0] = 1;
        }
    //minus
    }else{
        axis = ~(axis)+1;
        da[1] = 0x1<<(axis>>3);
        //値が-256以下
        if( da[1] == 0 ){
            da[1] = 0x80000000;
        }
    }

    ////////////////////////////////////////////////////////
    /// ラインの補完(前回値との間を補完)
    ////////////////////////////////////////////////////////
    if( mode == 1 ){
        if( ( (da[0] != da2[0]) || (da[1] != da2[1]) ) && mode_on == 1 ){
            tmp[0] = da[0];
            tmp[1] = da[1];
            da[0] |= da2[0];
            da[1] |= da2[1];
            da2[0] = tmp[0];
            da2[1] = tmp[1];

            for( i=0 ;i<2;i++ ){
                a = 1;

                for( j=0 ;j<32;j++){
                    if( da[i]&a ){
                        flg++;
                    }

                    if( flg==1 ){
                        da[i] |= a;
                    }else if(flg==2){
                        break;
                    }
                    a<<=1;
                }
            }
        }
        mode_on=1;
    }else{
        da2[0] = 0;
        da2[1] = 0;
        mode_on= 0;
    }

    //plus
    dest[0] = da[0];
    dest[1] = da[0]>>8;
    dest[2] = da[0]>>16;
    dest[3] = da[0]>>24;
    //minus
    dest[4] = da[1];
    dest[5] = da[1]>>8;
    dest[6] = da[1]>>16;
    dest[7] = da[1]>>24;
}
